In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [5]:
password = getpass()
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [7]:
# 1. How many distinct (different) actors' last names are there?

query = 'SELECT COUNT(DISTINCT(last_name)) FROM actor;'
pd.read_sql_query(query, engine)

   COUNT(DISTINCT(last_name))
0                         121

In [18]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week

query = '''SELECT *, DATE_FORMAT(rental_date, "%%W") AS 'rental_weekday',
            CASE
                WHEN DAYOFWEEK(rental_date) = 1 then 'weekend'
                WHEN DAYOFWEEK(rental_date) BETWEEN 2 AND 6 then 'workday'
                WHEN DAYOFWEEK(rental_date) = 7 then 'weekend'
                ELSE 'n/a'
            END AS 'day_type'
            FROM rental;'''
pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-16 01:30:53,Tuesday,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-16 01:30:53,Tuesday,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-16 01:30:53,Tuesday,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-16 01:30:53,Tuesday,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-16 01:30:53,Tuesday,workday
...,...,...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-16 01:30:53,Tuesday,workday
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-16 01:30:53,Tuesday,workday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-16 01:30:53,Tuesday,workday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-16 01:30:53,Tuesday,workday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-16 01:30:53,Tuesday,workday

In [22]:
# 3. Get all films with ARMAGEDDON in the title

query = 'SELECT * FROM film WHERE title LIKE "%%ARMAGEDDON%%";'
pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 09:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 09:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 09:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 09:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 09:03:42
5,844,STEERS ARMAGEDDON,A Stunning Character Study of a Car And a Girl...,2006,1,None,6,4.99,140,16.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 09:03:42

In [23]:
# 4. Get the 10 longest films

query = '''SELECT title, length FROM film
            ORDER BY length desc
            LIMIT 10;'''
pd.read_sql_query(query, engine)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [29]:
# 5. How many films include Behind the Scenes content

query = '''SELECT COUNT(special_features) AS "films_with_behind_the_scenes" 
            FROM film
            WHERE special_features LIKE "%%Behind the Scenes%%";'''
pd.read_sql_query(query, engine)

   films_with_behind_the_scenes
0                           538

In [30]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

query = '''SELECT rating, ROUND(AVG(length), 2) AS 'average_duration'
            FROM film
            GROUP BY rating
            HAVING AVG(length) > 120;'''
pd.read_sql_query(query, engine)

  rating  average_duration
0  PG-13            120.44

In [33]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column)
# In your output, only select the columns title, length, and the rank

query = '''SELECT title, length, RANK() OVER(ORDER BY length) film_rank
            FROM film
            WHERE (length IS NOT NULL) AND (length != 0);'''
pd.read_sql_query(query, engine).head(30)

                  title  length  film_rank
0          ALIEN CENTER      46          1
1             IRON MOON      46          1
2         KWAI HOMEWARD      46          1
3      LABYRINTH LEAGUE      46          1
4   RIDGEMONT SUBMARINE      46          1
5       DIVORCE SHINING      47          6
6       DOWNHILL ENOUGH      47          6
7        HALLOWEEN NUTS      47          6
8        HANOVER GALAXY      47          6
9            HAWK CHILL      47          6
10      SHANGHAI TYCOON      47          6
11      SUSPECTS QUILLS      47          6
12       ACE GOLDFINGER      48         13
13       HEAVEN FREEDOM      48         13
14  MIDSUMMER GROUNDHOG      48         13
15    NOTTING SPEAKEASY      48         13
16          ODDS BOOGIE      48         13
17     PARADISE SABRINA      48         13
18     PELICAN COMFORTS      48         13
19      RUSH GOODFELLAS      48         13
20        STEPMOM DREAM      48         13
21         SUNSET RACER      48         13
22  VALENTINE VANISHING      48         13
23      DOORS PRESIDENT      49         24
24     GROSSE WONDERFUL      49         24
25         HEAVENLY GUN      49         24
26        HOOK CHARIOTS      49         24
27     HURRICANE AFFAIR      49         24
28     ADAPTATION HOLES      50         29
29       BLUES INSTINCT      50         29